{"blog1":{"title":"Blog Post 1 - General Relativity","links":[],"tags":[],"content":"Hey everyone! Thanks for tuning into this next blog post; it’s a pretty long background one, so buckle up!\nIn this first post after the introduction, I’m going to go through a lot of the background reading on general relativity I’ve been doing recently (much of it from the textbooks Gravitation, by Wheeler, Misner, and Thorne, and Spacetime and Geometry, by Sean Carroll). General relativity is going to be a key foundational aspect of my senior project (black holes are, after all figments of general relativity; they don’t appear in classical physics at all!), so it’s worth laying some groundwork and getting it right.\nGeneral relativity, if you’re unfamiliar, is the theory that Einstein came up with in order to explain the various issues and inexplicable errors that the Newtonian description of gravity was returning—most famously, one related to the precession of Mercury’s orbit over time. There were deeper, more philosophical issues with general relativity too—Newton himself remarked in his original description of gravity how odd and unsettling it was that gravity acted seemingly instantly, with no delay. Einstein’s description of gravity sought to fix this and many of the other issues plaguing Newtonian gravity.\nHow exactly does Einstein’s gravity differ from Newton’s? In a great number of ways, but in one most important regard: Newtonian gravity is an explanationless, “hand-wavy” law that provides an inverse-square law that simply works, without providing any mechanism or underlying structure. Einstein’s gravity, on the other hand, provides a deeper reason for gravity’s existence: a “fictitious” force emerging from the geometry of spacetime itself. We’ll explore further what it means for a force to be fictitious or not, but for now what’s important is that general relativity is almost purely a geometric theory, leaving very little arbitrariness in the final result.\nThe Equations of General Relativity\nHow, specifically, does general relativity describe the motion of objects using nearly only geometry? Well, in the words of John Archibald Wheeler: “Matter tells spacetime how to curve, and curved spacetime tells matter how to move.” Not only is this a succinct explanation of general relativity (the distribution of matter and energy in the universe determines the geometry of spacetime, and in turn the geometry of spacetime determines how the matter distribution evolves!), but the two clauses of the quote perfectly identify and distinguish the two key equations of general relativity: the field equation and the geodesic equation.\nRμν​+21​Rgμν​−Λgμν​=c48πG​Tμν​ds2d2xμ​+Γαβμ​dsdxα​dsdxβ​=0​} Field Equation} Geodesic Equation​​\nDon’t be too intimidated by these equations yet! We’ll explain them in great depth soon enough.\nTensors\nYou might notice the above equations involve a lot of funny-looking quantities with 1 to 3 different indices that are on the top, bottom, or both, like Rμν​, gμν​, Tμν​, Γαβμ​, xα, and so on. These objects are tensors. Tensors are very useful mathematical structures that are central to general relativity. In some sense, tensors are a generalization of vectors: vectors are an array of values, while tensors can be a multidimensional array of values—while vectors have only one index, tensors can have arbitrarily many. But much like vectors, at least in physics, are a deeper concept than merely a list of values, tensors are also somewhat more complicated.\nAbove all, a tensor is an object that transforms like a tensor.\nOkay, perhaps not all that helpful. Let’s try that again.\nConsider a scalar field: what this means is that every point in space (and time) is associated with a single scalar (a number). Note that this representation does not depend on the coordinate system we use. If we shift our coordinate system, even if the numbers we use to describe certain points are different, we expect the same “physical point” to correspond to the same scalar value. Thus, scalars are invariant under a change in coordinate system. This coordinate invariance is a really important and very desirable quality for a mathematical object to have, since there is no “natural” or “correct” coordinate system—particularly in general relativity, where the coordinate system itself may be continuously changing as the fabric of spacetime adjusts to the current matter distribution. Thus, when physicists say “tensors are objects that transform like tensors,” it isn’t circular reasoning; what they mean is that tensors are multidimensional arrays that obey the following transformation law (which guarantees this “coordinate invariance”):\nTβ,...α,...​=α′,...,β′,...∑​Tβ′,...α′,...​∂xα′∂xα​...∂xβ∂xβ′​...\nIf the equation above confuses you, essentially: when you transform a tensor from some coordinate system (xα′,xβ′ to some system (xα,xβ, its value remains unchanged. Another confusion you might have: what’s going on with the superscripts and the subscripts? The answer is that tensors can have contravariant (superscripted) indices or covariant (subscripted) indices. We won’t go into the geometric nuances characterizing the difference between the two, but the basic premise is that covariant indices transform in the same way that the basis coordinates transform, while contravariant indices transform in the opposite manner. The important property that contravariant and covariant indices have is that they contract: when summing over a tensor with a contravariant index times one with the same covariant index, the two indices contract and are no longer a free index, as shown below:\na∑​Tba​Ka​=Tb′​\nHere, the index a was summed over and subsequently contracted.\nThe last important note about tensors is something called the Einstein convention. When tensors are contracted with one another, it is very common to sum over certain “repeated indices,” such as those shown in the above two equations. This is often a great hassle, and so Albert Einstein popularized the convention of simply ommitting the summation symbol, and leaving it implicit than any repeated index is to be summed over. (Einstein facetiously referred to this convention as his “greatest contribution to physics”—it certainly saves a lot of writing!)\nThe Field Equation\nRμν​+21​Rgμν​−Λgμν​=c48πG​Tμν​\nThe first clause of Wheeler’s quote explains the field equation: “Matter tells spacetime how to curve.” Einstein’s field equation describes the relationship between the matter/energy distribution of a region of spacetime, and the curvature of that region. (An important note: although the field equation looks quite beautiful and compact—and it is beautiful!—its compactness is somewhat misleading; with two “dummy” indices, μ and ν, the single field equation actually contains 16 different equations, one for each value of μ and ν, which can each take on a value from 0 to 3. It’s also worth noting that of these 16 equations there are only 10 unique ones, due to symmetry conditions on the relevant tensors). In particular, the right hand side of the equation describes the matter distribution; the tensor Tμν​, or the stress-energy tensor, encodes all the necessary information about the matter distribution of the region. The left hand side, however, is all about geometry. The most important quantity to note, by far, is the metric tensor gμν​. We’ll dive further into the metric tensor in future posts, since it’s central to the geodesic equation, which is the equation that’s more important for our project, but for the moment what’s important to know is that somehow this tensor gμν​ encodes the geometry of space.\nWhat about the rest of the left hand side then? Are Rμν​, R, and Λ separate quantifiers of geometry? Well, Λ is the cosmological constant, and it essentially quantifies the strength of dark energy. Dark energy is a sort of “hack” in general relativity to replicate the negative pressure density required to produce the sort of accelerating expansion of the universe that we’ve observed, but since in this project we’ll be dealing with relatively small physical setups (black holes), rather than with large-scale cosmology, we’re going to ignore Λ and set Λ=0. The remaining two quantities, it turns out, depend directly on gμν​—both are measures of “curvature”, and gμν​ completely describes the shape of spacetime, so all relevant information about curvature can be extracted. Specifically, the tensor that completely quantifies curvature, the Riemann tensor Rμνσρ​, can be derived solely from the metric tensor to be:\nRμνσρ​=21​gζρ(∂xν∂​∂xσ∂​gμζ​+∂xμ∂​∂xζ∂​gνσ​−∂xν∂​∂xζ∂​gμσ​−∂xμ∂​∂xσ∂​gνζ​)\nNote the use of the Einstein convention here: the repeated index ζ is being implicitly summed over. Another interesting thing note to make is that the Riemann tensor consists solely of second partial derivatives of the metric tensor: this makes intuitive sense; as you may remember from your single-variable calculus class, curvature is entirely a feature of the second derivative of a function. From the Riemann tensor, which contains all information about curvature, Rμν​ (the Ricci tensor) and R (the Ricci scalar) can be computed, according to the following relations:\nRμν​=Rμσνσ​\nR=gμνRμν​\n(Once again, note the use of the Einstein convention.)\nWhat we’ve shown here is that the entire left hand side of Einstein’s field equation depends only on the shape of spacetime (that is, on the metric tensor), while the right hand side depends only on the matter/energy distribution of spacetime (that is, on the stress-energy tensor). Therefore, the field equation relates the curved spacetime (gμν) to the matter within it (Tμν), thus fulfilling Wheeler’s claim that “matter tells spacetime how to curve.”\nI hope this has been a convincing and at least somewhat enlightening introduction to the mathematics of general relativity, and to Einstein’s field equation. We did a lot of handwave-y mathematical explanations here, and I haven’t even close to done justice to much of the mathematical rigor behind these concepts, but hopefully this has been an adequate introduction to the concept for our purposes. We will not be explicitly using the field equation in this project; rather, we will begin with a metric tensor gμν​ that was already derived from the field equation, from a given mass distribution, and then derive some interesting and potentially novel properties from it.\nStay tuned for that in the future! (And in the more immediate future, a blog post going into more depth on the geodesic equation as well.)\nSources\n\nMisner, Thorne, and Wheeler. Gravitation. Princeton University Press. 1973.\nCarroll, Sean. Spacetime and Geometry. Cambridge University Press. 2003.\n"},"blog2":{"title":"Blog Post 2 - Geodesics","links":[],"tags":[],"content":"Welcome back! This week, we’ll be continuing where we left off and talking about my reading on one of the most crucial concepts in general relativity: geodesics.\nGeodesics are in some way a generalization of the notion of “straight lines” in flat space; they’re the trajectories that free particles will travel through space. However, in curved space, they often won’t quite look “straight”: rather, they will move in a fashion determined by the metric tensor of that space.\nThe Shape of Space\nBefore we can introduce the metric tensor, we have to clarify what it even means for space to be “flat” or “curved” in the first place. When you think of curved space, there’s a good chance you’re thinking of something like this:\n\nThis is a very common representation: some sort of 2D sheet twisted in 3 dimensions. And in fact, the sheets shown above are in fact sheets with the aforementioned curvatures, but there’s a subtle nuance to be teased out here: a space does not (as implied by the image) require an extra dimension to “curve into.” That is, it is totally possible for a 2D sheet to be curved without a third dimension existing. The third dimension provides a useful visualization tool, but it is not a fundamental part of the definition of a curved space. What, then, is the definition of a curved space? To understand this, it will be worthwhile to take a detour a couple millennia into the past to talk about Euclid’s postulates.\nWhen Euclid set forth his seminal text on mathematics, the Elements, he laid out a number of extremely sensible assumptions (postulates or axioms), and used these assumptions along with the basic logic of proofs to derive a great number of theorems that we still study in school today. The Elements is still widely held as one of the earliest rigorous treatises on mathematics and has had a large influence on how early mathematics was formalized, but even more impressively, holds up extremely well over 2 thousand years later; almost all of Euclid’s logic and assumptions have withstood the test of time.\nAlmost.\nNow infamously known as Euclid’s Fifth Postule, or the Parallel Postulate, Euclid made the following claim (or technically, a claim equivalent to this) as one of his assumptions: if two lines are mutually perpendicular to a line, and are extended infinitely, they will never meet.\n\nOn first glance egregiously obvious, this postulate faced criticism over the years, with some mathematicians claiming that it was redundant and provable from the other postulates, although nobody was able to prove it. It was only two millennia later that Bernhard Riemann (remember the Riemann tensor from before?) finally proved Euclid right: the Parallel Postulate was not implied by Euclid’s other postulates. In fact, it was not even necessary. If you made a different assumption (i.e, parallel lines converge or diverge at a certain rate, or even do some weird oscillatory behavior), you got an equally consistent system of geometry that looked very different.\nIt turns out that Riemann’s calculations for parallel lines that approach each other describe the surface of a sphere (a “positively curved”) surface. If you look at the image of positive curvature above, you’ll see that in fact parallel lines approach each other. This gives us a solid definition of curvature: a positively curved space is a space in which parallel lines converge, and a negatively curved space that in which parallel lines diverge; no reference to an external dimension is required! Perhaps you’re already seeing the connection to gravity here. If not, consider the following thought experiment: two balls travel through space on parallel trajectories. What will happen to them over time? Well, gravity will slowly bring them to drift towards each other. This is exactly what we would expect of “straight lines” in a positively curved space!\nA note about terminology: “straight lines” is a strange term to ascribe to curving trajectories; these kinds of “free,” unaccelerated paths are straight in a flat space, but not necessarily in a curved space, so henceforth we will be calling them geodesics.\nThe Metric Tensor\nOne more thing to straighten out: how exactly do we quantify this “shape of space”? We could define some scalar which is just the degree to which the space is curved (0 for flat, &gt;0 for positively curved, &lt;0 for negatively curved), but we would quickly find this is highly inadequate. For example, what do we do about surfaces that have variable curvature? Local curvature will be very important to us when doing calculations with general relativity.\nOnce again, Riemann has this problem solved. One of the most significant contributions Riemann made to differential geometry (a field he basically founded) was to introduce a correspondence between the geometry of space and the notion of distance. In particular, what Riemann proved is that if you know the distance between any two points in a space (or equivalently, have some local definition of distance), you have all the information of that space. That is, a local notion of distance completely and uniquely defines a space in differetial geometry. So if we find the most general mathematical structure that can capture notions of distance, we have found the most general mathematical structure that can define the shape of space.\nThe notion of distance you’re probably familiar with comes from the Pythagorean Theorem:\nds2=dx2+dy2+dz2\nA distance (in flat, Euclidean space) is the sum of the squares of differentials, in an (x,y,z) coordinate system at least. Using coordinates of (r,θ,ϕ) we would get a slightly messier distance\nds2=dr2+r2dθ2+r2sin2θdϕ2\nThis equation which encodes the distance between two points is called the metric of a space. Note that both of the above equations are just the squares of differentials times some coefficients. Riemann showed that the most general metric depended only on these “second-order” differentials (i.e, the products of two differentials). Therefore, we could write the most general metric possible (and note, once again, the use of the Einstein convention for summation):\nds2=gij​dxidxj\nwhere gij​ is a set of coefficients that multiply these second-order differentials. This set of coefficients is all that is needed to specify the properties of a space, and as you may have deduced by now, is exactly the metric tensor. (The equation above isn’t quite enough to specify the behavior of the metric tensor, also necessary is to note that the metric tensor is symmetrical, so gij​=gji​.)\nA slight tangent: Note that I specified physical spaces above. The astute and/or pedantic topology enthusiast might at this point protest that the above equation does not cover all spaces, which is true: for instance, the famous Manhattan metric ds=∣dx∣+∣dy∣ is not of this form. However, these kinds of spaces are highly non-physical and beyond the purview of general relativity.\nWe’re nearly done with the metric tensor, just one more nuance to mention: since we are dealing not with space but instead with spacetime, we will be working in coordinates of either (t,x,y,z) or (t,r,θ,ϕ). When time is not included as a coordinate, it is convention in general relativity to use Latin letters to denote indices (as in gij​), while when time is included, it is convention to use Greek letters (as in gμν​).\nNext week, we’ll finally talk about the geodesic equation in full, and complete our background reading, so tune in again!\nSources\n\nMisner, Thorne, and Wheeler. Gravitation. Princeton University Press. 1973.\nCarroll, Sean. Spacetime and Geometry. Cambridge University Press. 2003.\n"},"blog3":{"title":"Blog Post 3 - An Exercise in Geodesics","links":[],"tags":[],"content":"Welcome to my next blog post! I’ve been promising for a few weeks now to get into the details of the geodesic equation, which governs how objects move through curved spacetime, so let’s handle that today. In particular, I’m going to present a step-by-step derivation to come to the geodesic equation, which, as I was reading, helped me understand why the geodesic equation takes the form it does. It’s not quite a proof, as it isn’t fully formalized, but I would think of it more as a convincing argument. This will be a more technical, in-depth blog post, but I think it’s worth going over given how important understanding the motion of geodesics will be to our project.\nFormalizing Geodesics\nAs a brief recap of what we covered last week, a geodesic is an “unaccelerated” path that a particle might take—that is, the free-fall trajectory of a particle. (When we say “unaccelerated,” we are ignoring all forces except gravity, since Einstein argues that gravity does not act on particles as an external force but rather is a feature of the geometry of spacetime.) Thinking back to classical physics, we might naively write that the equation of motion of a geodesic is a=0, or\ndtdv​=0\nThis is all the geodesic equation really is! And in Newtonian mechanics, it’s usually enough to stop there—given the position function x(t)=(x(t),y(t),z(t)) of a particle, we can solve for its entire trajectory (noting that v=dtdx​), and in this simple case we would find that it would travel in a straight line at constant velocity (as Newton’s First Law would imply). But as we try to generalize this to arbitrary, non-flat spacetimes, what changes?\nWell, the first change we must make to generate our geodesic equation has less to do with geometry and more to do with relativity; in relativity, time is no longer an independent, global entity that ticks at a constant rate for all observers, but rather a feature of the frame of reference an observer is in; that is, time becomes a dimension on the same footing as space, and in fact is a part of the coordinate system. As our geometry of spacetime warps, not only will our spatial coordinates warp, so too will our time coordinate. This has two implications: firstly, time t is no longer a useful quantity by which we can parameterize our trajectory, since the rate at which time changes (you can think of this as “the rate at which a clock ticks”) might vary from point to point along the trajectory. Secondly, because of this fact, we must now include time as a coordinate when describing our trajectory x.\nInstead of parameterizing via t, we will use as our parameter the proper time τ. The proper time is merely the time experienced by an observer in its own frame (i.e, the frame in which it is stationary). This proper time must necessarily tick at the same rate throughout for the observer in question, since it appears at rest with respect to itself. (There is an edge case that will become important later in our project—photons do not experience time, so proper time is meaningless! We’ll examine this more closely when we get to it, but the short answer is that we’ll be using a different paramter σ instead of proper time τ). Making these modifications, our trajectory can be expressed as x(τ)=(t(τ),x(τ),y(τ),z(τ)). One last notational change: it is often convention, so that one can sum over numerical indices, to give each of these 4 dimensions of spacetime numerical identifiers, so we can instead express our trajectory as x(τ)=(x0(τ),x1(τ),x2(τ),x3(τ)). (We start with time and label it 0 so that, by convention, the nonzero indices can represent spatial indices.)\nDeriving an Equation of Motion\nSo why is it enough to stop at the above equation in Newtonian mechanics, and why do we have to be more careful when involving curved spacetimes? This has to do with a rather subtle point about the nature of the basic vectors in which we define our coordinate system.\nLet’s back up a little. Convince yourself first that we can write our velocity vector v as\nv=vαeα​\nFirst of all, note the use of the Einstein convention (the Einstein convention, which I introduced in Blog Post 1, is super important! A lot of the equations I write from now on will be quite confusing if you don’t understand it.): here, the term on the right is a sum of vαeα​ from α=0 to 3. Also note that I’ve used a Greek letter α as my index, instead of Latin letter; you may recall that by convention, the use of Greek letters means that time is included as an index, and so we sum from 0 instead of 1.\nWhat this equation is saying, then, is that given some representation x(τ)=(x0(τ),x1(τ),x2(τ),x3(τ)), this corresponds to a vector in physical space by multiplying each component of this vector with a corresponding vector that we call a basis vector, and we have one basis vector for each dimension (e0​ being the basis vector for time, e1​ being the basis vector for the first spatial direction, etc.). An important technical side note, if you’re curious: it’s crucial that the set of basis vectors are linearly independent—this means that no linear combination of basis vectors can return another basis vector. This in turn implies that any vector that can be represented using these basis vectors has a unique representation, and so the mapping of sets of numbers (x0(τ),x1(τ),x2(τ),x3(τ)) to points in physical space is a 1-to-1 mapping.\nNow, in classical mechanics, we would simply find from our above geodesic equation a=0 that\ndtdv​=dtd​(viei​)=0\n(Note that I’ve used i since this is a classical equation.) But because the basis vectors are not functions of time, we can factor them out of the derivative and get that ei​dtd​vi=0. Now, since our basis vectors are linearly independent, for this sum to be zero, the coefficients of every basis vector must be 0; therefore, for each value of i it is true that\ndtd​vi=0\nThat is, the geodesic equation in classical mechanics is that objects have constant velocity, which is exactly what we expected. So what changes in general relativity? Simply put, the basis vectors are not constant along the geodesic. Because space can be arbitrarily warped, the coordinates that we considered basis vectors continuously deform along our curved surface. Expressing v as vαeα​ now to denote a relativistic geodesic, we get the following:\ndτdv​=dτd​(vαeα​)=vαdτdeα​​+dτdvα​eα​=0\nHaving expanded our time derivative using the product rule, we can express it as shown above in terms of both how components of velocity change over the trajectory, as well as how the basis vectors themselves (that is, the geometry of spacetime) changes throughout the trajectory. This second term is fairly straightforward; it can be computed as long as we know the rate of change of a component of velocity. The first term, however, might seem more foreign. How can we conceptualize the rate of change of the coordinate system itself?\nThe Christoffel Symbol\nThe answer is something called a Christoffel symbol. First of all, it may help to apply to expand that term and pick out some familiar features:\ndxβdeα​​dτdxβ​=vβdxβdeα​​\nUsing the multivariable chain rule to express the rate of change of the basis vectors as a sum, we can see that it depends on how the basis vectors change with the trajectory’s coordinates, and how those coordinates change with the proper time of the trajectory (which is just the velocity components!) The nice thing about expressing the rate of change of basis vectors with respect to a coordinate is that this depends only on the geometry of spacetime, and not on a particular trajectory, and so we can very generally compute these values, which are known as the Christoffel symbols, denoted by Γ. In particular, a particular Christoffel symbol is defined as\ndxβdeα​​=Γαβμ​eμ​\nIn other words, the Christoffel symbol Γαβμ​ denotes the rate of change of eα​ with respect to xν in the direction of eμ.\nIf we rewrite our above equation in terms of Christoffel symbols, and use the fact that vα=dtd​xα, we arrive at the most common form of the geodesic equation\ndτ2d2xμ​+Γαβμ​dτdxα​dτdxβ​=0\nwhich is true for each μ.\nAll that’s left is computing the Christoffel symbols themselves. This blog post has already grown a little bloated, so we won’t go into figuring this out from scratch, but hopefully it should make sense that the Christoffel symbols, which have to do with how the basis vectors defining a coordinate system change as you move around a spacetime, are entirely determined by the metric tensor we discussed in the last blog post, since the metric tensor fully characterizes the geometry of a space. Specifically, the Christoffel symbols come out to be\nΓαβμ​=21​gμσ​∂xβ​∂​gσα​+∂xα​∂​gσβ​−∂xσ​∂​gαβ​​\nWhat’s important to note is that they depend not directly on the metric tensor itself, but rather its derivatives, which makes sense (it quantifies how the metric tensor changes in particular directions). The Christoffel symbols are crucial to general relativity, and help conceptualize how a space changes along a trajectory.\nIf you didn’t understand all the math above, that’s alright! This was certainly a denser blog than usual. The key takeaway is that there exists an equation which, when given only a metric that describes the geometry of a spacetime, allows one to compute what geodesic trajectories through that spacetime look like (i.e, what curved paths objects will appear to follow). Next week, we’ll begin getting into the actual meat of the project, where we’ll be attempting to compute these geodesics (for photons, specifically) around a given metric (that of a black hole with certain properties).\nTune into the next post as we’ll finally begin talking about how black hole imaging connects with all of this!\nSources\n\nMisner, Thorne, and Wheeler. Gravitation. Princeton University Press. 1973.\nCarroll, Sean. Spacetime and Geometry. Cambridge University Press. 2003.\n"},"blog4":{"title":"Blog Post 4 - Autocorrelations and Critical Exponents","links":[],"tags":[],"content":"You may have noticed there’s been a bit of a break in the blog! I was out of town for a while and not updating the blog super regularly, but rest assured that over the next few days I’ll be updating you on all the material I’ve read and produced over the past few weeks!\nIn our last blog post, I teased that we would finally begin connecting our theoretical backgrounds to current work in black hole imaging, so that’s exactly what we’ll be doing today. All our work regarding general relativity has been highly general and theoretical, but we need to actually begin applying it to observables! In particular, we set out to study black holes, so we need to somehow connect the experimental observations and theoretical predictions of black holes to each other.\nThis turns out to be very difficult on both fronts: making theoretical predictions about black holes is highly nontrivial because the gravity around black holes is strong enough that general relativity must unavoidably be used, and the mathematics of general relativity (which we have already seen a glimpse of) can be quite complicated. To add to this difficulty, however, the experimental observation of black holes is very nearly impossible. First of all, as we have brought up before, black holes are black: technically, the “interesting” part of a black hole is complete unobservable. The singularity and the region of space around the singularity are “censored” by the presence of the event horizon due to the finite speed of light: photons very close to the singularity are unobservable to us. However, photons that are a little more distant from the black hole (the nearly bound photons we have been alluding to thus far) are more reasonable to observe. The engineering and mathematical challenges posed by attempting to observe these photon rings are of course still massive; most of the black holes we have attempted to observe are millions of light years away and capturing high-resolution, high-fidelity information from such distant objects is an extremely nontrivial task, and was the primary driving motivation of the Event Horizon Telescope collaboration.\nBut assuming we manage to work out the theoretical description of what a black hole should look like from far away, and we make real experimental observations of what a black hole actually does look like from far away, what can we expect to see and how can we compare the two?\nPhoton Rings\nConsider a black hole in the vacuum of space, and consider a sheet placed arbitrarily far away, which collects the photons that come from the black hole to form an image. What will this sheet see?\n\nWell, one can imagine that there are some photons that are far away enough from the black hole that they are barely affected by the black hole. We will call these (for reasons that will soon become obvious) n=0 photons. You can likely guess that a ring of photons that are equidistant from the black hole would be affected by it in the same way (due to the radial symmetry of this system), so we can say these photons form a “ring” around the black hole. (Technically photons unaffected by the black hole would have to be infinitely far away, but as we will see shortly, what we call n=0 photons don’t have to be completely unaffected, just unaffected to a certain degree). Now imagine a photon that is slightly closer to the black hole, such that it comes from behind the black hole, is strongly pulled towards it and travels around it once before making its way to our screen. This is an n=1 photon. These photons, by the same reasoning as above, also form a ring around the black hole. Now imagine a photon slightly closer, so that it has to orbit twice around the black hole until escaping to our screen. You may have guessed these are the n=2 photons, and they also form a ring around the black hole. The image below, from an animation by the Institute of Advanced Study, might help you visualize more clearly how these photon rings are formed:\n\nWhat we have shown (somewhat unrigorously, part of my project is to show this much more rigorously using the metric of a black hole) that when placing a screen “infinitely” far away from a black hole, what you can see, while not the black hole itself, is a series of concentric rings containing photons that have “wrapped around” the black hole different numbers of times. (In particular, we can show these rings get thinner and thinner, and that there are infinitely many of them.) In fact, one can show that all ideal black hole images will look exactly like this (via the no-hair theorem, which states that black holes have no extraneous properties). Even more usefully, the exact structure of these rings (more precisely, their relation to one another) depends, perhaps strongly, on the properties of the black hole (the strength of dependence of this structure on particular parameters of the black hole is another very strong interest of this project, in addition to merely the dependence itself). In particular, we can show that the three properties of a black hole (mass, charge, and angular momentum, according to the no-hair theorem) manifest in three critical exponents that parameterize the structure of these photon rings. We call these three critical exponents γ, δ, and τ, and deriving these critical exponents in terms of the properties of a black hole for the most general metrics possible is the primary focus of this senior project.\nThe Critical Exponents\nRecall that the “photon ring” of a black hole is not in fact one ring but an infinite series of concentric, self-similar photon rings, as we described above. The appearance of a particular photon ring depends less on the black hole itself and more on the photons (the black hole’s structure, of course, will not determine the wavelength or other properties of this ring). What the black hole itself determines is how these photon rings are related to one another. Each self-similar ring is identical to the previous ring, except for three distinctions: it is “demagnified” (less bright), it is rotated, and it is delayed in time (the photons from that ring took longer to reach our arbitrarily far screen than the previous ring’s photons did). This is what the three critical exponents parameterize. In particular, the (n+1)th ring will be demagnified by a factor of e−γ, rotated through an angle of δ radians, and shifted in time by t (in natural units) from the nth ring (γ, the most well studied of the critical exponents, even has its own name—the Lyapunov exponent). By studying the most general possible metric of a black hole (one that accounts for mass, spin, and charge), we can derive highly general expressions for each of these three critical exponents, and compare them to the critical exponents we observe in black hole images in order to deduce the parameters of the black hole purely from the image (and even to test whether or not the exponents take the form that we expect them to—a promising test of the no-hair theorem and of general relativity more broadly). However, measuring these critical exponents for real black holes turns out to be a highly nontrivial problem.\nAutocorrelations\nOf course, if we had telescopes of infinite precision and were measuring ideal black holes, once a black hole was imaged, extracting these critical exponents would be a trivial matter. However, real black holes are surrounded not by ideal photons but by complex mixtures of gas and plasma that behave irregularly and noisily. But the concentric rings formed by geodesics orbiting the black holes different numbers of times still exist; so what we can do in analyzing these black hole images is to recognize a particular “disturbance” in the plasma that surrounds the black hole, and realize that any visible disturbance in the black hole image must be visible not just once but infinitely many times, and each time will be demagnified, rotated, and shifted in time, exactly as predicted by the critical exponents. More realistically, due to how noisy these plasma mixtured typically are, we record the photon ring over a given period of time, treating it as a (2+1)-dimensional object (having 2-dimensions of space, and 1-dimension of time), and we build what is known as a correlation function of the black hole image; a function that quantifies how related various parts of the image are to other parts of the image in space and time. In theory (following some highly sophisticated statistical and machine learning algorithms) this correlation function can be used to estimate the critical exponents.\nIn reality, this is not yet possible due to the precision required for these correlation functions to produce any reliable results, but this process remains a very active area of research so that, when telescopes with great enough precision are built, such correlation functions can be applied in order to compare these images with theoretical results like the ones we are deriving in this project. This process, known as autocorrelation, while something I have great interest in, is not the focus of this project, which is more theoretical in nature, but I think for perspective it is useful to keep in mind the larger picture when it comes to black hole image analysis, to remind ourselves why exact we are calculating all of these obscure expressions. Once correlation algorithms and black hole telescopes have reached a certain level of sophistication, we can use them to compute the critical exponents for real black holes and test various theories of gravity.\nThis post has been a less in-depth one than typically—a break from the theory-heavy, math-heavy previous blog posts to take a step back and survey exactly what we are doing and what we hope to gain from it. We jump back into the heavy details in the next post, however (coming extremely soon!), as I will lay out the full details of the Lyapunov exponent—exactly what it quantifies and what research has already been done it, as well as the derivation of it for highly general black holes and how it depends on various parameters of the black hole. We should finally see some original math and graphs in the next post, so stay tuned for that!\nSources\n\nHadar, Shahar, et al. “Photon Ring Autocorrelations.” Physical Review D, vol. 103, no. 10, May 2021, p. 104038. arXiv.org, doi.org/10.1103/PhysRevD.103.104038.\nKapec, Daniel, and Alexandru Lupsasca. “Particle Motion near High-Spin Black Holes.” Classical and Quantum Gravity, vol. 37, no. 1, Jan. 2020, p. 015006. arXiv.org, doi.org/10.1088/1361-6382/ab519e.\n"},"index":{"title":"Blog Post 0 - Introduction","links":["/","blog1","blog2","blog3"],"tags":[],"content":"Welcome!\nWelcome to my blog!\nOver the coming weeks, I’ll be using this blog to walk through my senior project about black holes and photon rings step-by-step. (The blog is also available at its original home here, but the blog on this site has the math formatted a little more nicely.) The first posts will be background posts, dedicated to understanding the basics of general relativity and black holes, so that everyone reading has a clear starting point for what exactly we’re studying, and a basic framework for how strange, exotic objects like black holes behave and why they behave the way they do. After this, I’ll move on to the current literature about the particular problem I’m interested in (more on that below), and the current gaps in said literature. Lastly, I’ll get to my own contributions to the topic and why I think they’re significant, as well as why I think studying black holes so closely, despite already being very well-studied objects, is such a promising avenue in contemporary physics.\nDon’t worry if you don’t understand everything I’ll be elaborating on below yet; my goal here is just to give you a teaser of what my project hopes to accomplish and what this blog will cover in the future—once you read my background and literature review posts, hopefully the things said here that might have confused you will make a lot more sense. Additionally, as a general disclaimer, some of the later posts might be somewhat math-heavy, but don’t be too alarmed: I’ll do my best to make everything completely comprehensible if you skip over all the math, although trying to think through the math would certainly be useful for those who are interested.\nEssentially, my project deals with what data can potentially be inferred from black hole images. Black holes images are a very delicate business: for one, black holes are, as the name suggests, black. This means that no light escapes them, making them technically impossible to image. This is where the photon rings come into the picture: although black holes themselves are completely un-imageable, since any photons within the black hole’s radius of innermost stable circular orbit never escape it, photons slightly outside the horizon (“nearly bound” photons, as they are often known) do escape, and are seen in images as rings around the black holes.\n\nYou can see above the most iconic black hole image (and one of the few ever taken): the black hole M87* as imaged by the EHT (Event Horizon Telescope), and in this photo you can see the photon rings I’ve referred to, albeit with somewhat low resolution. Because black holes are theoretically very well-studied objects, and the behavior of spacetime around black holes (at least outside their event horizon) has a significant corpus of literature, we can use the equations of motion for photons around black holes to predict what an image of the photon rings around a black hole with certain properties—and conversely we can try to deduce said properties given an image of a photon ring, although this problem is significantly more difficult. My project is (mostly) concerned with the former problem: what should the image of a black hole (or technically, its photon rings) look like given its properties? What characteristic features or structures emerge from the photon rings as a result of these properties, and how, mathematically, do these features depend on said properties?\nMost importantly—why does any of this matter? What does studying the behavior of photons around black holes light-years away from us even help us understand? This is a question that I will come back to later in the blog, but the short answer has to do with the extreme environments created around black holes that are found in very few other places in nature. The laws of physics are currently very well understood for very nearly any physical system imaginable; general relativity describes even the most massive objects, for example, and quantum mechanics even the smallest. But thes models tend to break down at the union of these two situations: the physics of very small regions of space with very high densities of mass or energy is one of the most gaping holes in our understanding of physics, in part because there are very few sources of experimental data for physical systems of this kind. The behavior of high-energy particles or the extreme conditions of the Big Bang have historically been where physicists have searched for answers to these questions, but many, many questions remain unanswered even after pursuing these avenues. I believe that with the advent of black hole imaging, an entirely novel route has opened up to study the physics of the extreme, and there is great potential over the coming years to use black holes, previously extensively studied theoretically but never observed, as a probe of the geometry of more general physical theories.\nMy hope is that while reading through this blog you gain some insight not only into my project, but also into the physics underpinning it and the frontiers of our current understanding. As I explained above, future posts will start quite general, with general relativity (hah?), before delving into the more specific nuances of black hole imaging, and possibly (time permitting) how the analytical techniques I’ve used here could be generalized to theories beyond GR.\nThanks for reading, and stay tuned!\nSidhant\nAll Posts\nPost 0\nPost 1\nPost 2\nPost 3"}}